# Пути к файлам
ENCODED_FILE = "cod7.txt"
DECODED_FILE = "decoded_text.txt"
DECRYPTION_KEY_FILE = "decryption_key.txt"

# Словарь замен символов
REPLACEMENTS = {
    "`": "Я", "1": "Й", "d": "Ш", "9": "Г", "p": "Ф", "c": "Щ", "o": "У",
    "x": "Э", "t": "Х", "}": "Л", "{": "К", "0": "Е", "s": "Ь",
    "f": "Ц", "7": "Б", "n": "С", "q": "М", "4": "Ж", "z": "Ю",
    "5": "Д", "r": "П", "w": "Н", "8": "В", "3": "З", ";": "Ы",
    "/": "К", "6": "А", "m": "Р", "2": "И", "i": "Т", "k": "Ч",
    "e": "О", "-": " "
}
